//=====================================
//
//ベースパーティクル処理[BaseParticle.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "BaseParticle.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle()
{
	uv.u = uv.v = 0.0f;
	active = false;
}

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle(int life)
{
	uv.u = uv.v = 0.0f;
	active = false;
	this->lifeFrame = life;
}

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle(int lifeMin, int lifeMax)
{
	uv.u = uv.v = 0.0f;
	active = false;
	this->lifeFrame = Math::RandomRange(lifeMin, lifeMax);
}

/**************************************
デストラクタ
***************************************/
BaseParticle::~BaseParticle()
{
}