//=====================================
//
//ベースパーティクル処理[BaseParticle.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "BaseParticle.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle() :
	GameObject(false),
	uv(ParticleUV())
{

}

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle(int life) :
	GameObject(false),
	uv(ParticleUV()),
	lifeFrame(life)
{

}

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle(int lifeMin, int lifeMax) :
	GameObject(false),
	uv(ParticleUV()),
	lifeFrame(Math::RandomRange(lifeMin, lifeMax))
{

}

/**************************************
デストラクタ
***************************************/
BaseParticle::~BaseParticle()
{
}

/**************************************
アクティブ判定
***************************************/
bool BaseParticle::IsActive() const
{
	if (!active)
		return false;

	return cntFrame <= lifeFrame;
}