//=====================================
//
//ゲームオブジェクト処理[GameObject.cpp]
//Author:GP12A332 21 立花雄太
//
//=====================================
#include "GameObject.h"
#include "Transform.h"

/**************************************
マクロ定義
***************************************/

/**************************************
コンストラクタ
***************************************/
GameObject::GameObject()
{
	transform = new Transform();
	active = true;
}

/**************************************
デストラクタ
***************************************/
GameObject::~GameObject()
{
	SAFE_DELETE(transform);
}

/**************************************
アクティブ判定
***************************************/
bool GameObject::IsActive()
{
	return active;
}

/**************************************
アクティブ状態セット処理
***************************************/
void GameObject::SetActive(bool active)
{
	this->active = active;
}
