//=============================================================================
//
// 入力処理 [input.cpp]
// Author : 
//
//=============================================================================
#include "input.h"

//*****************************************************************************
// staticメンバ
//*****************************************************************************
Input* Input::mInstance = NULL;

//*****************************************************************************
// コンストラクタ
//*****************************************************************************
Input::Input()
{
	if (mInstance == NULL)
	{
		mInstance = this;
	}

	pad = new GamePad();
	keyboard = new Keyboard();
	mouse = new Mouse();
}

//=============================================================================
// 入力処理の初期化
//=============================================================================
HRESULT Input::Init(HINSTANCE hInst, HWND hWnd)
{
	HRESULT hr;

	if(!pDInput)
	{
		// DirectInputオブジェクトの作成
		hr = DirectInput8Create(hInst, DIRECTINPUT_VERSION,
									IID_IDirectInput8, (void**)&pDInput, NULL);
	}

	// キーボードの初期化
	keyboard->Init(hInst, hWnd, pDInput);

	//マウス初期化
	mouse->Init(hInst, hWnd, pDInput);

	//パッド初期化処理
	pad->Init(pDInput);

	return S_OK;
}

//=============================================================================
// 入力処理の終了処理
//=============================================================================
Input::~Input()
{
	// キーボードの終了処理
	SAFE_DELETE(keyboard);

	//マウス終了処理
	SAFE_DELETE(mouse);

	//パッド終了処理
	SAFE_DELETE(pad);

	if(pDInput)
	{// DirectInputオブジェクトの開放
		pDInput->Release();
		pDInput = NULL;
	}
}

//=============================================================================
// 入力処理の更新処理
//=============================================================================
void Input::Update(void)
{
	// キーボードの更新
	keyboard->Update();

	//マウス更新処理
	mouse->Update();

	//ゲームパッド更新処理
	pad->Update();
}
